content/blog/unix-layout.md
+++
title = "Unix layout Keyboards"
author = ["Robert Clay"]
date = 2021-01-30
lastmod = 2021-01-31T09:36:11+09:00
categories = ["topic"]
draft = false
+++

## Do you remember the last time you actually used your caps-lock key? {#do-you-remember-the-last-time-you-actually-used-your-caps-lock-key}

I didn't really give it much thought until I started using Emacs, but I would
love to have a control key where it is easier to use. I have been a fan of
keyboard shortcuts for a ling time, but Emacs really was the tipping point that
made me realize I could find a better use for my caps-lock key.

A quick search online will pull up an article or two on "Emacs pinky" which
apparently comes from using the control key usually found in the lower left of
most keyboards. And considering of the more common commands in Emacs is [C-c C-c]
or "Control-c Control-c", it makes sense that using a finger like your pinky
that much could lead to problems. I was surprised to hear that a lot Emacs users
used their caps-lock key in place of the normal control key...which they also
use with their pinky.

Then when I decided to try it (by heading into the registry settings of Windows

1.  I realized what made the caps key easier on my pinky. It was the weight.

When reaching down to the bottom of the keyboard to reach the normal control
key, I was putting more of the weight of my entire hand into the gesture,
and while holding the key down, I would tend to rest the weight of my hand on
that pinky while I rotated the rest of my hand to connect the key to the next
key.


## Some keyboards have a UNIX layout where the usual caps key in a control key {#some-keyboards-have-a-unix-layout-where-the-usual-caps-key-in-a-control-key}

Late last year when I got a HHKB, I realized why keyboards like this don't
keep their caps key in the normal place, and instead bury it in a function
layer. Interestingly enough, so do Apple laptops in Japan. Japanese language
input rarely needs a caps key (there is no concept of a "capital letter" in
Japanese) so Apple decided to stick something more useful there. And since I
started using a layout like this, I find myself using keyboard short cuts for
more and more things.

I read some differing opinions of people online who tired a control key where
their caps-lock is, and found it didn't help them at all. I think it works for
some people and not for others. But for me, I wish I had discovered it sooner.

I was not big on the commands [C-a] for "move cursor to beginning of the line",
or [C-e] to go to the end of the line... UNTIL I moved a control key to be right
next to my left pinky. It's so easy now, that when I want to move my cursor back
in a terminal to delete some text at the front of a command, I don't even think
about it. My muscle memory pulls out command "a" and my cursor is where I want
it to be. I use vim motions in Emacs now, but it's nice to be able to do some
basic moves while still in insert mode.


## Give it a try, you might be surprised {#give-it-a-try-you-might-be-surprised}

If you don't want to fiddle with keybinding software or the Windows registry it
might not be worth it for you. If you are on a Mac, there is an OS level setting
you can use to turn your caps key into a control key (or at least there was in
older versions of MacOS). Maybe one day the caps lock key will find a new home
in a slightly less prominent place on the standard computer keyboard.
